Autodesk.Revit.DB.AssemblyDifferenceNamingCategory.NamingCategoryId2
Naming category id of the second assembly
Since:
2012

Autodesk.Revit.DB.AssemblyDifferenceNamingCategory.NamingCategoryId1
Naming category id of the first assembly
Since:
2012

Autodesk.Revit.DB.AssemblyDifferenceNamingCategory
The two assemblies being compared have different naming categories
Since:
2012